Repository: Bozsokaroly/password_manager_API
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: hu

source: Please provide user details
hu: Kérem adjon meg felhasználói adatokat

source: Bad request
hu: Hibás kérés

source: User already exists
hu: A felhasználó már létezik

source: Conflict
hu: Ütközés

source: Successfully created new user
hu: Új felhasználó sikeresen létrehozva

source: Something went wrong
hu: Valami hiba történt

source: Invalid data
hu: Érvénytelen adatok

source: Successfully fetched auth token
hu: Hitelesítő token sikeresen lekérve

source: Error fetching auth token!, invalid email or password
hu: Hiba a hitelesítő token lekérésekor! Érvénytelen e-mail vagy jelszó

source: Unauthorized
hu: Jogosulatlan

source: Something went wrong!
hu: Valami hiba történt!

source: Bad Request
hu: Hibás kérés

source: failed to create a new data
hu: új adat létrehozása sikertelen

source: successfully created a new data
hu: új adat sikeresen létrehozva

source: data not found
hu: adat nem található

source: Not Found
hu: Nem található

source: successfully retrieved a data
hu: adat sikeresen lekérve

source: failed to retrieve all datas
hu: az összes adat lekérése sikertelen

source: successfully retrieved all data
hu: minden adat sikeresen lekérve

source: failed to retrieve all data
hu: az adatok lekérése sikertelen

source: data not found for user
hu: a felhasználóhoz nem található adat

source: Not found
hu: Nem található

source: successfully updated a data
hu: adat sikeresen frissítve

source: failed to update a data
hu: az adat frissítése sikertelen

source: successfully deleted a data
hu: adat sikeresen törölve

source: failed to delete a data
hu: az adat törlése sikertelen

source: failed to retrieve a data
hu: adat lekérése sikertelen

source: The text record can't be null
hu: A szöveges bejegyzés nem lehet üres

source: Data not found
hu: Adat nem található

source: error
hu: hiba

source: Data expired
hu: Az adat lejárt

source: shared the following with you
hu: megosztotta az alábbiakat Önnel

source: Password manager share function
hu: Jelszókezelő megosztási funkció

source: copy
hu: másolás

source: data copied to clipboard.
hu: adat vágólapra másolva.

source: Forbidden
hu: Tilos

source: Endpoint Not Found
hu: Végpont nem található

source: A token is required for access
hu: Hozzáféréshez token szükséges

source: Token is not valid
hu: A token érvénytelen

source: An error occurred during token validation
hu: Hiba történt a token ellenőrzése során

source: Invalid email format
hu: Érvénytelen e-mail formátum

source: Password is invalid.
hu: Érvénytelen jelszó.

source: Name must be between 2 and 30 words
hu: A név 2 és 30 szó közötti kell, hogy legyen

source: Email and Password is required
hu: E-mail és jelszó megadása kötelező

source: Email format is incorrect
hu: Az e-mail formátuma helytelen

source: Password does not meet the required standards
hu: A jelszó nem felel meg a szükséges követelményeknek
